#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_compute_instance_v2.cloud-info-keycloak: Refreshing state... [id=b0ffdd8d-1580-4e4d-bdeb-d2af09473aa2]
openstack_compute_instance_v2.cloud-info: Refreshing state... [id=cdc10857-56ea-445f-a3b3-2819cf765a16]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_compute_instance_v2.cloud-info must be replaced
-/+ resource "openstack_compute_instance_v2" "cloud-info" {
      ~ access_ip_v4        = "192.168.1.58" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_name         = "svc1.m" -> (known after apply)
      ~ id                  = "cdc10857-56ea-445f-a3b3-2819cf765a16" -> (known after apply)
      ~ image_name          = "ubuntu-18.04-amd64-raw" -> (known after apply)
        name                = "cloud-info"
      + region              = (known after apply)
      ~ security_groups     = [
          - "ssh - open",
            # (1 unchanged element hidden)
        ]
      - tags                = [] -> null
      ~ user_data           = "3838a0f798f41f6a1a6aa60f12b5d63fd9c4fe42" -> "bdd2ef5b273706b109e37edf7e7b812212201313" # forces replacement
        # (5 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.1.58" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:6a:ce:d2" -> (known after apply)
          ~ name           = "cloud_egi_net" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # openstack_compute_instance_v2.cloud-info-keycloak must be replaced
-/+ resource "openstack_compute_instance_v2" "cloud-info-keycloak" {
      ~ access_ip_v4        = "192.168.1.137" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_name         = "svc1.m" -> (known after apply)
      ~ id                  = "b0ffdd8d-1580-4e4d-bdeb-d2af09473aa2" -> (known after apply)
      ~ image_name          = "ubuntu-18.04-amd64-raw" -> (known after apply)
        name                = "cloud-info-keycloak"
      + region              = (known after apply)
      ~ security_groups     = [
          - "ssh - open",
            # (1 unchanged element hidden)
        ]
      - tags                = [] -> null
      ~ user_data           = "ee3b9d12a31af22e3d7836e4f1fb68dd55608f46" -> "9e992d856bdab29dd4ca731d123a08cfc264cd3d" # forces replacement
        # (5 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.1.137" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:df:9c:ee" -> (known after apply)
          ~ name           = "cloud_egi_net" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @enolfc, Action: `pull_request`*